import streamlit as st
from sklearn.naive_bayes import GaussianNB
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt


df = pd.read_excel('./data/heart.xlsx')



html_0 = """
<div style="background-color:#0E1117;border-bottom: 3px solid #ffffff;border-top: 3px solid #ffffff;">
<center><h3>Example data table</h3></center>
</div>
"""
st.markdown(html_0, unsafe_allow_html=True)
st.markdown("")
st.write(df.head(10))

html_1 = """
<div style="background-color:#0E1117;border-bottom: 3px solid #ffffff;border-top: 3px solid #ffffff;margin-top:20px;">
<center><h3>Class Prediction</h3></center>
</div>
"""
st.markdown(html_1, unsafe_allow_html=True)
st.markdown("")


s1 = st.number_input("อายุของผู้ป่วย")
s2 = st.slider("เพศของผู้ป่วย (0 : หญิง | 1 : ชาย)",0,1)
s3 = st.slider("อาการเจ็บหน้าอก\n(1 : โรคหลอดเลือดหัวใจตีบทั่วไป | 2 : โรคหลอดเลือดหัวใจตีบผิดปรกติ | 3 : อาการปวดที่ไม่ใช่โรคหลอดเลือดหัวใจตีบ | 4 : ไม่มีอาการ)",1,4)
s4 = st.number_input("ความดันโลหิตขณะพัก (มม. ปรอท)")
s5 = st.number_input("cholestoral ใน mg/dl ดึงผ่านเซ็นเซอร์ BMI")
s6 = st.slider("น้ําตาลในเลือดขณะอดอาหาร > 120 มก./ดล. (1 = จริง 0 = เท็จ)",0,1)
s7 = st.slider("พักผลการตรวจคลื่นไฟฟ้าหัวใจ ( 0 : ปกติ | 1 : มีความผิดปกติของคลื่น ST-T | 2 : แสดงกระเป๋าหน้าท้องยั่วยวนซ้ายที่เป็นไปได้หรือแน่นอนตามเกณฑ์ของเอสเตส)",0,2)
s8 = st.number_input("อัตราการเต้นของหัวใจสูงสุดทําได้")
s9 = st.slider("การออกกําลังกายทําให้เกิดโรคหลอดเลือดหัวใจตีบ (1 = ใช่ 0 = ไม่ใช่)",0,1)
s10 = st.number_input("จุดสูงสุดก่อนหน้า")
s11 = st.slider("Slope",0,2)
s12 = st.slider("number of major vessels (0-3)",0,3)
s13 = st.slider("Thal rate",0,3)

if st.button("ทำนายผล"):

   X=df.drop(["output"],axis=1)
   y=df["output"]

   nb_model = GaussianNB()
   nb_model.fit(X, y)


   x_input = np.array([[s1, s2, s3, s4, s5, s6, s7, s8, s9, s10, s11, s12, s13]])

   out = nb_model.predict(x_input)

   if out[0]== 0 :
          
      html_3 = """
      <div style="background-color:#0E1117;padding:20px;border: 3px solid #ffffff;">
      <center><h3 style="border-bottom: 3px solid #ffffff;">โอกาสหัวใจวายน้อย</h3></center>
      <left><h6 style="text-indent: 30px;line-height: 1.5;padding-top:15px;">สุขภาพการนอนเป็นส่วนสำคัญของสุขภาพทั่วๆ ไป และมีผลมากต่อความเป็นอยู่ของบุคคลในทุกวัย การนอนไม่เพียงแต่เติมพลังให้ร่างกายและสมอง แต่ยังมีผลต่อการทำงานของระบบฮอร์โมน การฟื้นตัวของร่างกาย และการนอนที่ดีเป็นสิ่งสำคัญที่มีผลดีต่อสุขภาพทั้งร่างกายและจิตใจ นี่คือบางแนวทางที่ช่วยให้คุณมีการนอนที่ดี</h6></left>
      <ul>
         <li>ตั้งเวลานอนและตื่น: พยายามที่จะนอนและตื่นขึ้นในเวลาเดียวกันทุกวัน, แม้วันหยุด การทำเช่นนี้ช่วยปรับลำดับการนอนของร่างกาย.</li>
         <li>สร้างสภาพแวดล้อมที่เหมาะสม: ให้ห้องนอนมีแสงสว่างที่น้อยลงในช่วงเวลาที่เตรียมตัวนอน และให้ห้องมีอุณหภูมิและความชื้นที่สบาย.</li>
         <li>หลีกเลี่ยงสิ่งกระตุ้น: หลีกเลี่ยงการดื่มกาแฟหรือเครื่องดื่มที่มีคาเฟอีนหลังบ่าย, และหลีกเลี่ยงการใช้สมาร์ทโฟนหรืออุปกรณ์อิเล็กทรอนิกส์ที่มีแสงสว่างสีฟ้าในช่วงเวลาที่ใกล้เข้าสู่การนอน.</li>
         <li>ทำกิจกรรมผ่อนคลายก่อนนอน: ทำกิจกรรมที่ช่วยผ่อนคลายเช่น อ่านหนังสือ, ฟังเพลงสบาย ๆ, หรือการทำโยคะ.</li>
         <li>ปฏิบัติการนอนที่สบาย: ใช้ที่นอนที่มีความสูงพอดี และใช้หมอนที่รองรับคอ.</li>
         <li>หลีกเลี่ยงการนอนกลางวัน: หากเป็นไปได้, หลีกเลี่ยงการนอนในช่วงเวลากลางวันหรือที่มีแสงแวดล้อม.</li>
         <li>การออกกำลังกาย: การออกกำลังกายสม่ำเสมอมีผลในการปรับปรุงคุณภาพการนอน แต่ควรหลีกเลี่ยงการออกกำลังกายในช่วงเวลาเย็นหรือก่อนนอน.</li>
         <li>รักษาน้ำหนัก: การรักษาน้ำหนักที่เหมาะสมสามารถช่วยลดโอกาสการเกิดปัญหาทางการนอน.</li>
         <li>หลีกเลี่ยงการรับประทานอาหารหนักในช่วงเย็น: การรับประทานอาหารหนักในช่วงเย็นอาจทำให้มีการย่อยอาหารที่ยากลำบากและมีผลต่อการนอน.</li>
         <li>หลีกเลี่ยงสารระงับการนอน: การลดหรือหยุดดื่มแอลกอฮอล์หรือสารที่ทำให้ร่างกายเครียด.</li>
      </ul>
      </div>
      """
      st.markdown(html_3, unsafe_allow_html=True)
      st.markdown("")

   elif out[0]==1:
          
          
      html_4 = """
      <div style="background-color:#0E1117;padding:20px;border: 3px solid #ffffff;">
      <center><h3 style="border-bottom: 3px solid #ffffff;">โอกาสหัวใจวายมาก</h3></center>
      <left><h6 style="text-indent: 30px;line-height: 1.5;padding-top:15px;">โรคหัวใจวาย (Coronary Artery Disease, CAD) เป็นภาวะที่เกิดจากการสะสมของเส้นเลือดในหัวใจ (หลอดเลือดในหัวใจ) ทำให้การไหลของเลือดที่จำเป็นสำหรับการให้สารอาหารและออกซิเจนให้กับกล้ามเนื้อหัวใจลดลง สาเหตุหลักของโรคหัวใจวายคือการสะสมของตะกอนไขมันและแร่ธาตุในเส้นเลือดในหัวใจ (เช่น เนื้อเยื่อไขมัน, เซลล์เลือดขาว, และแคลเซียม) ซึ่งทำให้เกิดลิ่ม (plaque) ในเส้นเลือด ลิ่มนี้จะทำให้เส้นเลือดตีบ และสามารถทำให้เกิดอาการหัวใจวาย นี่คือบางคำแนะนำที่อาจมีประโยชน์</h6></left>
      <ul>
         <li>ควบคุมประจำอยู่ของความดันโลหิต : ความดันโลหิตสูงเป็นปัจจัยที่เสี่ยงในการเป็นโรคหัวใจวาย ดังนั้นควรตรวจสอบความดันโลหิตอย่างสม่ำเสมอ และดูแลให้ควบคุมอยู่ในระดับที่เหมาะสมตามคำแนะนำของแพทย์</li>
         <li>การรักษาน้ำหล่อเลี้ยง : การรับประทานอาหารที่มีประโยชน์ต่อหัวใจ เช่น ผักผลไม้, อาหารที่มีไขมันไม่เบาหรือไขมันดี, และเส้นใยสามารถช่วยลดความเสี่ยง</li>
         <li>การออกกำลังกาย : การออกกำลังกายเป็นส่วนสำคัญของการรักษาหัวใจ แนะนำให้ทำกิจกรรมทางกายเช่น เดินเร็ว, วิ่ง, ว่ายน้ำ, หรือการออกกำลังกายแบบอื่น ๆ อย่างสม่ำเสมอ</li>
         <li>การเลิกสูบบุหรี่ : การเลิกสูบบุหรี่จะช่วยลดความเสี่ยงของโรคหัวใจวาย</li>
         <li>การบริหารจัดการสเตรส : การมีวิธีการบริหารจัดการสเตรสอย่างมีประสิทธิภาพ เช่น การฝึกสมาธิ, การทำโยคะ, หรือการเรียนรู้วิธีการทำให้ตนเองผ่อนคลาย</li>
         <li>การตรวจสุขภาพประจำปี : การตรวจสุขภาพประจำปีเป็นการตรวจสอบความสมบูรณ์ของร่างกาย และช่วยค้นพบปัญหาทางสุขภาพที่เริ่มพัฒนาได้ตั้งแต่ต้น</li>
         <li>การทำงานร่วมกับทีมการรักษา : การปรึกษาแพทย์และทีมการรักษาสามารถช่วยในการวางแผนการดูแลและการรักษาให้เหมาะสม</li>
         <li>การพักผ่อน : การให้ร่างกายพักผ่อนเป็นส่วนสำคัญของการรักษาหัวใจ</li>
      </ul>
      <left><h6 style="text-indent: 30px;line-height: 1.5;padding-top:15px;">คำแนะนำเหล่านี้เป็นเพียงแนวทางทั่วไป ควรปรึกษาแพทย์เพื่อการวินิจฉัยที่แม่นยำและรับคำแนะนำเพิ่มเติมเพื่อการรักษาที่เหมาะสมต่อสถานะสุขภาพของแต่ละบุคคล</h6></left>
      </div>
      """
      st.markdown(html_4, unsafe_allow_html=True)
      st.markdown("")

     